In [28]:
# important first import pandas and numpy
import pandas as pd
import numpy as np


# To connect with daba base
from sqlalchemy import create_engine

In [29]:
# Create connection
sqlitedb_path = '../data/raw/emiliopatio.db'
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [44]:
# list all tables in database

pd.read_sql_query("SELECT * FROM sqlite_master WHERE type='table'", engine)

,type,name,tbl_name,rootpage,sql
0,table,rank_info,rank_info,2,CREATE TABLE rank_info (\n\tid BIGINT NOT NULL...
1,table,personal_info,personal_info,34,CREATE TABLE personal_info (\n\tid BIGINT NOT ...
2,table,business_info,business_info,155,CREATE TABLE business_info (\n\tid BIGINT NOT ...

In [45]:
# read tables and go to dataframe


def read_tables():
    business = pd.read_sql_query("SELECT * FROM business_info", engine)
    personal = pd.read_sql_query("SELECT * FROM personal_info", engine)
    rank = pd.read_sql_query("SELECT * FROM rank_info", engine)

    return rank

In [42]:
read_tables()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,2813,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,8910,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,3919,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,6449,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,5032,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5
...,...,...,...,...,...,...,...
2203,2065,2255,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134
2204,2207,2256,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134
2205,3442,2257,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856
2206,8144,2258,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978
2207,9807,2259,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978

In [43]:
rank

NameError: name 'rank' is not defined

In [ ]:
df_merge_personal_and_business = pd.merge(personal, business, on='id')
df_all = pd.merge(df_merge_personal_and_business, rank, on='id')

In [ ]:
# MERGE AND SAVE TABLES to CSV
# 1. merge personal and business dataframes
# 2. merge personal,business and rank dataframes
# 3. Save all tables to CSV file


df_all = pd.DataFrame()

def merge_tables():
    df_merge_personal_and_business = pd.merge(personal, business, on='id')
    df_all = pd.merge(df_merge_personal_and_business, rank, on='id')
    return df_all

In [ ]:
df_all

In [ ]:
# Save table merged as df_all 
def save_table(df):
    df_all.to_csv('df_all.csv')
    return 

# Call function
save_table(df_all)
df_all

In [ ]:
# list of columns to delete

def delete_columns():
    all_columns = list(df_all.columns)
    columns_valids = ['id', 'age','worth','name', 'position']
    return df_all

In [ ]:
  all_columns = list(df_all.columns)
all_columns

In [ ]:
# rename columns names 

def rename_columns_names():
    df_all.rename(index={e: e+1 for e in range(len(df_all))}, 
                    columns={'lastName': 'ppplastname',
                            'Source': 'source',
                            'worthChange':'worthchange',
                            'realTimeWorth':'realtimeworth',
                            'realTimePosition':'realtimeposition'}, 
                    inplace=True)
    return

In [ ]:
df_all

In [ ]:
# delete invalid columns for analysis

data = df_all[[x for x in df_all.columns if x in columns_valids]]
data

In [ ]:
data.dtypes

In [ ]:
data._get_numeric_data()

In [ ]:
# probar añadiendo esta columna al df y eliminando la columna name
c = df_all['name'].str.lower()
c

In [ ]:
df_all['name'] = df_all['name'].apply(lambda x: x.lower())
df_all

In [ ]:
df_all['lastname'] = df_all['lastname'].apply(lambda x: x.lower())
df_all

In [ ]:
# for drop write inplace = True to final

df_all.drop(['unnamed: 0','unnamed: 0_x', 'unnamed: 0_y', 'realtimeworth'], axis=1, inplace = True)
df_all

In [ ]:
df_all.isnull().sum()

In [ ]:
df_all['age'] = df_all['age'].str.replace('years old', '')
df_all['age']

In [ ]:
df_all['age'] = df_all['age'].str.replace('years old', '')
df_all['worthchange'] = df_all['worthchange'].str.replace('millions USD', '')
df_all.head(20)